artillery.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 20

scenarios:
  - name: "Log in user"
    flow:
      - post:
          url: "/users/login"
          json:
            email: "sri@gmail.com"
            password: "123a"

  - name: "GET user profile"
    flow:
      - get:
          url: "/users/64a608c0743acacbd6fb3243"